Revit 2024 API
BuiltInFailures.MultiReferenceAnnotationFailures.MultiReferenceAnnotationReferenceCategoryForcesDeletion Property
 Changing the reference category will cause instances of this annotation type to be deleted, because they no longer match their references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MultiReferenceAnnotationReferenceCategoryForcesDeletion { get; }
Visual Basic
Public Shared ReadOnly Property MultiReferenceAnnotationReferenceCategoryForcesDeletion As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MultiReferenceAnnotationReferenceCategoryForcesDeletion {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MultiReferenceAnnotationFailures Class
Autodesk.Revit.DB Namespace